export default function poetry(verse) {
    const userEndingLetter = verse[verse.length - 1];

    const versesCollection = [
        {
            verse: "ای خوشا مستانه سر در پای دلبر داشتن     دل تهی از خوب و زشت چرخ اخضر داشتن",
            startingLetter: "ا",
        },
        {
            verse: "بخویش، هیمه گه سوختن بزاری گفت     که ای دریغ، مرا ریشه سوخت زین آذر",
            startingLetter: "ب",
        },
        {
            verse: "پیرمردی، مفلس و برگشته بخت     روزگاری داشت ناهموار و سخت",
            startingLetter: "پ",
        },
        {
            verse: "تاجری در کشور هندوستان     طوطئی زیبا خرید از دوستان",
            startingLetter: "ت",
        },
        {
            verse: "ثمری گر ندهد آه فغان خواهد داد     اثری گر نکند ناله دعا خواهم کرد",
            startingLetter: "ث",
        },
        {
            verse: "جهاندیده کشاورزی بدشتی     بعمری داشتی زرعی و کشتی",
            startingLetter: "ج",
        },
        {
            verse: "چو آتش دود کرد و شعله سر داد     بناگه طائری آواز در داد",
            startingLetter: "چ",
        },
        {
            verse: "حکایت کرد سرهنگی به کسری     که دشمن را ز پشت قلعه راندیم",
            startingLetter: "ح",
        },
        {
            verse: "خلید خار درشتی بپای طفلی خرد     بهم برآمد و از پویه باز ماند و گریست",
            startingLetter: "خ",
        },
        {
            verse: "دید موری در رهی پیلی سترک     گفت باید بود چون پیلان بزرگ",
            startingLetter: "د",
        },
        {
            verse: "ذره تا مهر نبیند به ثریا نرسد     زآسمان بگذرم ار بر منت افتد نظری",
            startingLetter: "ذ",
        },
        {
            verse: "روزی گذشت پادشهی از گذرگهی     فریاد شوق بر سر هر کوی و بام خاست",
            startingLetter: "ر",
        },
        {
            verse: "ز سری، موی سپیدی روئید     خنده‌ها کرد بر او موی سیاه",
            startingLetter: "ز",
        },
        {
            verse: "ژاله از نرگس فرو بارید و گل را آب داد     وز تگرگ روح پرور مالش عناب داد",
            startingLetter: "ژ",
        },
        {
            verse: "سرو خندید سحر، بر گل سرخ     که صفای تو به جز یکدم نیست",
            startingLetter: "س",
        },
        {
            verse: "شنیده‌اید میان دو قطره خون چه گذشت     گه مناظره، یک روز بر سر گذری",
            startingLetter: "ش",
        },
        {
            verse: "صبحدم، تازه گلی خودبین گفت     کاز چه خاک سیهم در پهلوست",
            startingLetter: "ص",
        },
        {
            verse: "ذوقی چنان ندارد بی دوست زندگانی     دودم به سر برآمد زین آتش نهانی",
            startingLetter: "ذ",
        },
        {
            verse: "طائری کز آشیان، پرواز بهر آز کرد     کیفرش، فرجام بال و پر بخون آلودن است",
            startingLetter: "ط",
        },
        {
            verse: "ظریفی کرد و بیرون از ظریی     شاید کرد با مستان حریفی",
            startingLetter: "ظ",
        },
        {
            verse: "عمرت تا به کي به خود پرستي گذرد     يا در پي هستي و نيستي گذرد",
            startingLetter: "ع",
        },
        {
            verse: "غسل در اشک زدم کاهل طریقت گویند     پاک شو اول و پس دیده بر آن پاک انداز",
            startingLetter: "غ",
        },
        {
            verse: "بنفشه صبحدم افسرد و باغبان گفتش     که بیگه از چمن آزرد و زود روی نهفت",
            startingLetter: "ف",
        },
        {
            verse: "قاضی بغداد، شد بیمار سخت     از عدالتخانه بیرون برد رخت",
            startingLetter: "ق",
        },
        {
            verse: "کبوتر بچه‌ای با شوق پرواز     بجرئت کرد روزی بال و پر باز",
            startingLetter: "ک",
        },
        {
            verse: "گفت دیوار قصر پادشهی     که بلندی، مرا سزاوار است",
            startingLetter: "گ",
        },
        {
            verse: "لاله‌ای با نرگس پژمرده گفت     بین که ما رخساره چون افروختیم",
            startingLetter: "ل",
        },
        {
            verse: "مرغی بباغ رفت و یکی میوه کند و خورد     ناگه ز دست چرخ بپایش رسید سنگ",
            startingLetter: "م",
        },
        {
            verse: "نهان شد از گل زردی گلی سپید که ما     سپید جامه و از هر گنه مبرائیم",
            startingLetter: "ن",
        },
        {
            verse: "وقت سحر، به آینه‌ای گفت شانه‌ای     کاوخ! فلک چه کجرو و گیتی چه تند خوست",
            startingLetter: "و",
        },
        {
            verse: "همای دید سوی ماکیان بقلعه و گفت     که این گروه، چه بی‌همت و تن آسانند",
            startingLetter: "ه",
        },
        {
            verse: "یکی مرغ زیرک، ز کوتاه بامی     نظر کرد روزی، بگسترده دامی",
            startingLetter: "ی",
        },
    ];

    for(const poem of versesCollection) {
        if(poem.startingLetter === userEndingLetter) {
            return poem.verse;
        }
    }
}